# Imputation mittels Pandas

Siehe auch: Imputation

In [13]:
import pandas as pd

# Beispiel-Daten
df = pd.DataFrame({
    'Alter': [25, 30, None, 35, 40],
    'Gehalt': [50000, None, 70000, 80000, 90000]
})

# Die NaN werden mit Mean imputiert

# df['Gehalt'].fillna(df['Gehalt'].mean(), inplace=True) # Veraltet 
df['Gehalt'] = df['Gehalt'].fillna(df['Gehalt'].mean())

df

   Alter   Gehalt
0   25.0  50000.0
1   30.0  72500.0
2    NaN  70000.0
3   35.0  80000.0
4   40.0  90000.0

In [12]:
import pandas as pd

# Beispiel-Daten
df = pd.DataFrame({
    'Alter': [25, 30, None, 35, 40],
    'Gehalt': [50000, None, 70000, 80000, 90000]
})

# Die NaN werden mit Mean imputiert

# df['Gehalt'].fillna(df['Gehalt'].mode(), inplace=True) # Veraltet 
df['Alter'] = df['Alter'].fillna(df['Alter'].mean())

df

   Alter   Gehalt
0   25.0  50000.0
1   30.0      NaN
2   32.5  70000.0
3   35.0  80000.0
4   40.0  90000.0